AlmAck/svdtonuttx/demo/h/da1470x_uart3.h
/****************************************************************************
 * ./tmp/da1470x_uart3.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __DA1470X_UART3_H
#define __DA1470X_UART3_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include "da1470x_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register offsets *********************************************************/

#define DA1470X_UART3_UART3_CONFIG_OFFSET        0x001C /* ISO7816 Config Register */
#define DA1470X_UART3_UART3_CTRL_OFFSET          0x00E0 /* ISO7816 Control Register */
#define DA1470X_UART3_UART3_CTR_OFFSET           0x00FC /* Component Type Register */
#define DA1470X_UART3_UART3_DLF_OFFSET           0x00C0 /* Divisor Latch Fraction Register */
#define DA1470X_UART3_UART3_DMASA_OFFSET         0x00A8 /* DMA Software Acknowledge */
#define DA1470X_UART3_UART3_ERR_CTRL_OFFSET      0x00E8 /* ISO7816 Error Signal Control Register */
#define DA1470X_UART3_UART3_HTX_OFFSET           0x00A4 /* Halt TX */
#define DA1470X_UART3_UART3_IER_DLH_OFFSET       0x0004 /* Interrupt Enable Register */
#define DA1470X_UART3_UART3_IIR_FCR_OFFSET       0x0008 /* Interrupt Identification Register/FIFO Control Register */
#define DA1470X_UART3_UART3_IRQ_STATUS_OFFSET    0x00EC /* ISO7816 Interrupt Status Register */
#define DA1470X_UART3_UART3_LCR_EXT_OFFSET       0x00CC /* Line Extended Control Register */
#define DA1470X_UART3_UART3_LCR_OFFSET           0x000C /* Line Control Register */
#define DA1470X_UART3_UART3_LSR_OFFSET           0x0014 /* Line Status Register */
#define DA1470X_UART3_UART3_MCR_OFFSET           0x0010 /* Modem Control Register */
#define DA1470X_UART3_UART3_MSR_OFFSET           0x0018 /* Modem Status Register */
#define DA1470X_UART3_UART3_RAR_OFFSET           0x00C4 /* Receive Address Register */
#define DA1470X_UART3_UART3_RBR_THR_DLL_OFFSET   0x0000 /* Receive Buffer Register */
#define DA1470X_UART3_UART3_RFL_OFFSET           0x0084 /* Receive FIFO Level. */
#define DA1470X_UART3_UART3_SBCR_OFFSET          0x0090 /* Shadow Break Control Register */
#define DA1470X_UART3_UART3_SDMAM_OFFSET         0x0094 /* Shadow DMA Mode */
#define DA1470X_UART3_UART3_SFE_OFFSET           0x0098 /* Shadow FIFO Enable */
#define DA1470X_UART3_UART3_SRBR_STHR0_OFFSET    0x0030 /* Shadow Receive/Transmit Buffer Register */
#define DA1470X_UART3_UART3_SRBR_STHR10_OFFSET   0x0058 /* Shadow Receive/Transmit Buffer Register */
#define DA1470X_UART3_UART3_SRBR_STHR11_OFFSET   0x005C /* Shadow Receive/Transmit Buffer Register */
#define DA1470X_UART3_UART3_SRBR_STHR12_OFFSET   0x0060 /* Shadow Receive/Transmit Buffer Register */
#define DA1470X_UART3_UART3_SRBR_STHR13_OFFSET   0x0064 /* Shadow Receive/Transmit Buffer Register */
#define DA1470X_UART3_UART3_SRBR_STHR14_OFFSET   0x0068 /* Shadow Receive/Transmit Buffer Register */
#define DA1470X_UART3_UART3_SRBR_STHR15_OFFSET   0x006C /* Shadow Receive/Transmit Buffer Register */
#define DA1470X_UART3_UART3_SRBR_STHR1_OFFSET    0x0034 /* Shadow Receive/Transmit Buffer Register */
#define DA1470X_UART3_UART3_SRBR_STHR2_OFFSET    0x0038 /* Shadow Receive/Transmit Buffer Register */
#define DA1470X_UART3_UART3_SRBR_STHR3_OFFSET    0x003C /* Shadow Receive/Transmit Buffer Register */
#define DA1470X_UART3_UART3_SRBR_STHR4_OFFSET    0x0040 /* Shadow Receive/Transmit Buffer Register */
#define DA1470X_UART3_UART3_SRBR_STHR5_OFFSET    0x0044 /* Shadow Receive/Transmit Buffer Register */
#define DA1470X_UART3_UART3_SRBR_STHR6_OFFSET    0x0048 /* Shadow Receive/Transmit Buffer Register */
#define DA1470X_UART3_UART3_SRBR_STHR7_OFFSET    0x004C /* Shadow Receive/Transmit Buffer Register */
#define DA1470X_UART3_UART3_SRBR_STHR8_OFFSET    0x0050 /* Shadow Receive/Transmit Buffer Register */
#define DA1470X_UART3_UART3_SRBR_STHR9_OFFSET    0x0054 /* Shadow Receive/Transmit Buffer Register */
#define DA1470X_UART3_UART3_SRR_OFFSET           0x0088 /* Software Reset Register. */
#define DA1470X_UART3_UART3_SRTS_OFFSET          0x008C /* Shadow Request to Send */
#define DA1470X_UART3_UART3_SRT_OFFSET           0x009C /* Shadow RCVR Trigger */
#define DA1470X_UART3_UART3_STET_OFFSET          0x00A0 /* Shadow TX Empty Trigger */
#define DA1470X_UART3_UART3_TAR_OFFSET           0x00C8 /* Transmit Address Register */
#define DA1470X_UART3_UART3_TFL_OFFSET           0x0080 /* Transmit FIFO Level */
#define DA1470X_UART3_UART3_TIMER_OFFSET         0x00E4 /* ISO7816 Timer Register */
#define DA1470X_UART3_UART3_UCV_OFFSET           0x00F8 /* Component Version */
#define DA1470X_UART3_UART3_USR_OFFSET           0x007C /* UART Status register. */

/* Register addresses *******************************************************/

#define DA1470X_UART3_BASE                       0x50020200 /* UART3 registers */

#define DA1470X_UART3_UART3_CONFIG               (DA1470X_UART3_BASE + DA1470X_UART3_UART3_CONFIG_OFFSET) /* ISO7816 Config Register */
#define DA1470X_UART3_UART3_CTRL                 (DA1470X_UART3_BASE + DA1470X_UART3_UART3_CTRL_OFFSET) /* ISO7816 Control Register */
#define DA1470X_UART3_UART3_CTR                  (DA1470X_UART3_BASE + DA1470X_UART3_UART3_CTR_OFFSET) /* Component Type Register */
#define DA1470X_UART3_UART3_DLF                  (DA1470X_UART3_BASE + DA1470X_UART3_UART3_DLF_OFFSET) /* Divisor Latch Fraction Register */
#define DA1470X_UART3_UART3_DMASA                (DA1470X_UART3_BASE + DA1470X_UART3_UART3_DMASA_OFFSET) /* DMA Software Acknowledge */
#define DA1470X_UART3_UART3_ERR_CTRL             (DA1470X_UART3_BASE + DA1470X_UART3_UART3_ERR_CTRL_OFFSET) /* ISO7816 Error Signal Control Register */
#define DA1470X_UART3_UART3_HTX                  (DA1470X_UART3_BASE + DA1470X_UART3_UART3_HTX_OFFSET) /* Halt TX */
#define DA1470X_UART3_UART3_IER_DLH              (DA1470X_UART3_BASE + DA1470X_UART3_UART3_IER_DLH_OFFSET) /* Interrupt Enable Register */
#define DA1470X_UART3_UART3_IIR_FCR              (DA1470X_UART3_BASE + DA1470X_UART3_UART3_IIR_FCR_OFFSET) /* Interrupt Identification Register/FIFO Control Register */
#define DA1470X_UART3_UART3_IRQ_STATUS           (DA1470X_UART3_BASE + DA1470X_UART3_UART3_IRQ_STATUS_OFFSET) /* ISO7816 Interrupt Status Register */
#define DA1470X_UART3_UART3_LCR_EXT              (DA1470X_UART3_BASE + DA1470X_UART3_UART3_LCR_EXT_OFFSET) /* Line Extended Control Register */
#define DA1470X_UART3_UART3_LCR                  (DA1470X_UART3_BASE + DA1470X_UART3_UART3_LCR_OFFSET) /* Line Control Register */
#define DA1470X_UART3_UART3_LSR                  (DA1470X_UART3_BASE + DA1470X_UART3_UART3_LSR_OFFSET) /* Line Status Register */
#define DA1470X_UART3_UART3_MCR                  (DA1470X_UART3_BASE + DA1470X_UART3_UART3_MCR_OFFSET) /* Modem Control Register */
#define DA1470X_UART3_UART3_MSR                  (DA1470X_UART3_BASE + DA1470X_UART3_UART3_MSR_OFFSET) /* Modem Status Register */
#define DA1470X_UART3_UART3_RAR                  (DA1470X_UART3_BASE + DA1470X_UART3_UART3_RAR_OFFSET) /* Receive Address Register */
#define DA1470X_UART3_UART3_RBR_THR_DLL          (DA1470X_UART3_BASE + DA1470X_UART3_UART3_RBR_THR_DLL_OFFSET) /* Receive Buffer Register */
#define DA1470X_UART3_UART3_RFL                  (DA1470X_UART3_BASE + DA1470X_UART3_UART3_RFL_OFFSET) /* Receive FIFO Level. */
#define DA1470X_UART3_UART3_SBCR                 (DA1470X_UART3_BASE + DA1470X_UART3_UART3_SBCR_OFFSET) /* Shadow Break Control Register */
#define DA1470X_UART3_UART3_SDMAM                (DA1470X_UART3_BASE + DA1470X_UART3_UART3_SDMAM_OFFSET) /* Shadow DMA Mode */
#define DA1470X_UART3_UART3_SFE                  (DA1470X_UART3_BASE + DA1470X_UART3_UART3_SFE_OFFSET) /* Shadow FIFO Enable */
#define DA1470X_UART3_UART3_SRBR_STHR0           (DA1470X_UART3_BASE + DA1470X_UART3_UART3_SRBR_STHR0_OFFSET) /* Shadow Receive/Transmit Buffer Register */
#define DA1470X_UART3_UART3_SRBR_STHR10          (DA1470X_UART3_BASE + DA1470X_UART3_UART3_SRBR_STHR10_OFFSET) /* Shadow Receive/Transmit Buffer Register */
#define DA1470X_UART3_UART3_SRBR_STHR11          (DA1470X_UART3_BASE + DA1470X_UART3_UART3_SRBR_STHR11_OFFSET) /* Shadow Receive/Transmit Buffer Register */
#define DA1470X_UART3_UART3_SRBR_STHR12          (DA1470X_UART3_BASE + DA1470X_UART3_UART3_SRBR_STHR12_OFFSET) /* Shadow Receive/Transmit Buffer Register */
#define DA1470X_UART3_UART3_SRBR_STHR13          (DA1470X_UART3_BASE + DA1470X_UART3_UART3_SRBR_STHR13_OFFSET) /* Shadow Receive/Transmit Buffer Register */
#define DA1470X_UART3_UART3_SRBR_STHR14          (DA1470X_UART3_BASE + DA1470X_UART3_UART3_SRBR_STHR14_OFFSET) /* Shadow Receive/Transmit Buffer Register */
#define DA1470X_UART3_UART3_SRBR_STHR15          (DA1470X_UART3_BASE + DA1470X_UART3_UART3_SRBR_STHR15_OFFSET) /* Shadow Receive/Transmit Buffer Register */
#define DA1470X_UART3_UART3_SRBR_STHR1           (DA1470X_UART3_BASE + DA1470X_UART3_UART3_SRBR_STHR1_OFFSET) /* Shadow Receive/Transmit Buffer Register */
#define DA1470X_UART3_UART3_SRBR_STHR2           (DA1470X_UART3_BASE + DA1470X_UART3_UART3_SRBR_STHR2_OFFSET) /* Shadow Receive/Transmit Buffer Register */
#define DA1470X_UART3_UART3_SRBR_STHR3           (DA1470X_UART3_BASE + DA1470X_UART3_UART3_SRBR_STHR3_OFFSET) /* Shadow Receive/Transmit Buffer Register */
#define DA1470X_UART3_UART3_SRBR_STHR4           (DA1470X_UART3_BASE + DA1470X_UART3_UART3_SRBR_STHR4_OFFSET) /* Shadow Receive/Transmit Buffer Register */
#define DA1470X_UART3_UART3_SRBR_STHR5           (DA1470X_UART3_BASE + DA1470X_UART3_UART3_SRBR_STHR5_OFFSET) /* Shadow Receive/Transmit Buffer Register */
#define DA1470X_UART3_UART3_SRBR_STHR6           (DA1470X_UART3_BASE + DA1470X_UART3_UART3_SRBR_STHR6_OFFSET) /* Shadow Receive/Transmit Buffer Register */
#define DA1470X_UART3_UART3_SRBR_STHR7           (DA1470X_UART3_BASE + DA1470X_UART3_UART3_SRBR_STHR7_OFFSET) /* Shadow Receive/Transmit Buffer Register */
#define DA1470X_UART3_UART3_SRBR_STHR8           (DA1470X_UART3_BASE + DA1470X_UART3_UART3_SRBR_STHR8_OFFSET) /* Shadow Receive/Transmit Buffer Register */
#define DA1470X_UART3_UART3_SRBR_STHR9           (DA1470X_UART3_BASE + DA1470X_UART3_UART3_SRBR_STHR9_OFFSET) /* Shadow Receive/Transmit Buffer Register */
#define DA1470X_UART3_UART3_SRR                  (DA1470X_UART3_BASE + DA1470X_UART3_UART3_SRR_OFFSET) /* Software Reset Register. */
#define DA1470X_UART3_UART3_SRTS                 (DA1470X_UART3_BASE + DA1470X_UART3_UART3_SRTS_OFFSET) /* Shadow Request to Send */
#define DA1470X_UART3_UART3_SRT                  (DA1470X_UART3_BASE + DA1470X_UART3_UART3_SRT_OFFSET) /* Shadow RCVR Trigger */
#define DA1470X_UART3_UART3_STET                 (DA1470X_UART3_BASE + DA1470X_UART3_UART3_STET_OFFSET) /* Shadow TX Empty Trigger */
#define DA1470X_UART3_UART3_TAR                  (DA1470X_UART3_BASE + DA1470X_UART3_UART3_TAR_OFFSET) /* Transmit Address Register */
#define DA1470X_UART3_UART3_TFL                  (DA1470X_UART3_BASE + DA1470X_UART3_UART3_TFL_OFFSET) /* Transmit FIFO Level */
#define DA1470X_UART3_UART3_TIMER                (DA1470X_UART3_BASE + DA1470X_UART3_UART3_TIMER_OFFSET) /* ISO7816 Timer Register */
#define DA1470X_UART3_UART3_UCV                  (DA1470X_UART3_BASE + DA1470X_UART3_UART3_UCV_OFFSET) /* Component Version */
#define DA1470X_UART3_UART3_USR                  (DA1470X_UART3_BASE + DA1470X_UART3_UART3_USR_OFFSET) /* UART Status register. */

/* Register bit definitions *************************************************/


/* UART3_CONFIG Register */

