AlmAck/svdtonuttx/demo/h/da1470x_uart3.h
#define UART3_ISO7816_SCRATCH_PAD_MASK           (0x1F << 3) /* This register is for programmers to use as a temporary storage space. It has no  */
#define UART3_ISO7816_SCRATCH_PAD_POS            (3) /* This register is for programmers to use as a temporary storage space. It has no  */
#define UART3_ISO7816_ENABLE                     (1U << 2) /* 0 : Normal Uart 1 : ISO7816 Enabled */
#define UART3_ISO7816_ERR_SIG_EN                 (1U << 1) /* 0 : Error Signal feature disabled 1 : Error Signal feature enabled */
#define UART3_ISO7816_CONVENTION                 (1U << 0) /* 0 : Direct convention 1 : Inverse convention */

/* UART3_CTRL Register */

#define UART3_ISO7816_AUTO_GT                    (1U << 11) /* 0 : UART sends when tx data is available 1 : UART sends new character after guar */
#define UART3_ISO7816_ERR_TX_VALUE_IRQMASK       (1U << 10) /* 0 : ERR_TX_VALUE IRQ is masked 1 : ERR_TX_VALUE IRQ is enabled */
#define UART3_ISO7816_ERR_TX_TIME_IRQMASK        (1U << 9) /* 0 : ERR_TX_TIME IRQ is masked 1 : ERR_TX_TIME IRQ is enabled */
#define UART3_ISO7816_TIM_EXPIRED_IRQMASK        (1U << 8) /* 0 : timer expired IRQ is masked 1 : timer expired IRQ is enabled */
#define UART3_ISO7816_CLK_STATUS                 (1U << 7) /* 0 : iso7816 clock is stopped 1 : iso7816 clock is running */
#define UART3_ISO7816_CLK_LEVEL                  (1U << 6) /* 0 : iso7816 clock level low when stopped 1 : iso7816 clock level high when stopp */
#define UART3_ISO7816_CLK_EN                     (1U << 5) /* 0 : iso7816 clock disabled 1 : iso7816 clock enabled */
#define UART3_ISO7816_CLK_DIV_MASK               (0x1F << 0) /* ISO7816 clk freq = sclk/(2*(ISO7816_CLK_DIV+1) */
#define UART3_ISO7816_CLK_DIV_POS                (0) /* ISO7816 clk freq = sclk/(2*(ISO7816_CLK_DIV+1) */

/* UART3_CTR Register */

#define UART3_UART_CTR_MASK                      (0xFFFFFFFF << 0) /* Component Type Register */
#define UART3_UART_CTR_POS                       (0) /* Component Type Register */

/* UART3_DLF Register */

#define UART3_UART_DLF_MASK                      (0xF << 0) /* The fractional value is added to integer value set by DLH, DLL. Fractional value */
#define UART3_UART_DLF_POS                       (0) /* The fractional value is added to integer value set by DLH, DLL. Fractional value */

/* UART3_DMASA Register */

#define UART3_UART_DMASA                         (1U << 0) /* This register is use to perform DMA software acknowledge if a transfer needs to  */

/* UART3_ERR_CTRL Register */

#define UART3_ISO7816_ERR_PULSE_WIDTH_MASK       (0x1F << 4) /* When Error Signal feature is enable and receive mode, it gives the width of the  */
#define UART3_ISO7816_ERR_PULSE_WIDTH_POS        (4) /* When Error Signal feature is enable and receive mode, it gives the width of the  */
#define UART3_ISO7816_ERR_PULSE_OFFSET_MASK      (0xF << 0) /* When Error Signal feature is enable and receive mode, it gives the offset of the */
#define UART3_ISO7816_ERR_PULSE_OFFSET_POS       (0) /* When Error Signal feature is enable and receive mode, it gives the offset of the */

/* UART3_HTX Register */

#define UART3_UART_HALT_TX                       (1U << 0) /* This register is use to halt transmissions, so that the transmit FIFO can be fil */

/* UART3_IER_DLH Register */

#define UART3_PTIME_DLH7                         (1U << 7) /* Interrupt Enable Register: PTIME, Programmable THRE Interrupt Mode Enable. This  */
#define UART3_DLH6_5_MASK                        (0x3 << 5) /* Divisor Latch (High): Bit[6:5] of the 8 bit DLH register */
#define UART3_DLH6_5_POS                         (5) /* Divisor Latch (High): Bit[6:5] of the 8 bit DLH register */
#define UART3_ELCOLR_DLH4                        (1U << 4) /* Interrupt Enable Register: ELCOLR (read only), this bit controls the method for  */
#define UART3_EDSSI_DLH3                         (1U << 3) /* Interrupt Enable Register: EDSSI, Enable Modem Status Interrupt. This is used to */
#define UART3_ELSI_DLH2                          (1U << 2) /* Interrupt Enable Register: ELSI, Enable Receiver Line Status Interrupt. This is  */
#define UART3_ETBEI_DLH1                         (1U << 1) /* Interrupt Enable Register: ETBEI, Enable Transmit Holding Register Empty Interru */
#define UART3_ERBFI_DLH0                         (1U << 0) /* Interrupt Enable Register: ERBFI, Enable Received Data Available Interrupt. This */

/* UART3_IIR_FCR Register */

#define UART3_IIR_FCR_MASK                       (0xFF << 0) /* On Read Interrupt Identification Register : Bits[7:6], FIFO's Enabled (or FIFOSE */
#define UART3_IIR_FCR_POS                        (0) /* On Read Interrupt Identification Register : Bits[7:6], FIFO's Enabled (or FIFOSE */

/* UART3_IRQ_STATUS Register */

#define UART3_ISO7816_ERR_TX_VALUE_IRQ           (1U << 2) /* On read 1 : : If error signal is enabled and in transmit mode, module generates  */
#define UART3_ISO7816_ERR_TX_TIME_IRQ            (1U << 1) /* On read 1 : If error signal is enabled and in transmit mode, module generates IR */
#define UART3_ISO7816_TIM_EXPIRED_IRQ            (1U << 0) /* On read 1 : when Timer is expired. Timer has to be disabled to clear the IRQ. Wh */

/* UART3_LCR_EXT Register */

#define UART3_UART_TRANSMIT_MODE                 (1U << 3) /* Transmit mode control bit. This bit is used to control the type of transmit mode */
#define UART3_UART_SEND_ADDR                     (1U << 2) /* Send address control bit. This bit is used as a control knob for the user to det */
#define UART3_UART_ADDR_MATCH                    (1U << 1) /* Address Match Mode.This bit is used to enable the address match feature during r */
#define UART3_UART_DLS_E                         (1U << 0) /* Extension for DLS. This bit is used to enable 9-bit data for transmit and receiv */

/* UART3_LCR Register */

#define UART3_UART_DLAB                          (1U << 7) /* Divisor Latch Access Bit. This bit is used to enable reading and writing of the  */
#define UART3_UART_BC                            (1U << 6) /* Break Control Bit. This is used to cause a break condition to be transmitted to  */
#define UART3_UART_SP                            (1U << 5) /* Stick Parity. (writeable only when UART is not busy USR[0] is 0); otherwise alwa */
#define UART3_UART_EPS                           (1U << 4) /* Even Parity Select. Writeable only when UART is not busy (USR[0] is zero). This  */
#define UART3_UART_PEN                           (1U << 3) /* Parity Enable. Writeable only when UART is not busy (USR[0] is zero) This bit is */
#define UART3_UART_STOP                          (1U << 2) /* Number of stop bits. This is used to select the number of stop bits per characte */
#define UART3_UART_DLS_MASK                      (0x3 << 0) /* Data Length Select. This is used to select the number of data bits per character */
#define UART3_UART_DLS_POS                       (0) /* Data Length Select. This is used to select the number of data bits per character */

