AlmAck/svdtonuttx/demo/h/da1470x_uart3.h
/* UART3_LSR Register */

#define UART3_UART_ADDR_RCVD                     (1U << 8) /* Address Received Bit. If 9Bit data mode (LCR_EXT[0]=1) is enabled, this bit is u */
#define UART3_UART_RFE                           (1U << 7) /* Receiver FIFO Error bit. This bit is only relevant when FIFOs are enabled (FCR[0 */
#define UART3_UART_TEMT                          (1U << 6) /* Transmitter Empty bit. If FIFOs enabled (FCR[0] set to one), this bit is set whe */
#define UART3_UART_THRE                          (1U << 5) /* Transmit Holding Register Empty bit. If THRE mode is disabled (IER[7] set to zer */
#define UART3_UART_BI                            (1U << 4) /* Break Interrupt bit. This is used to indicate the detection of a break sequence  */
#define UART3_UART_FE                            (1U << 3) /* Framing Error bit. This is used to indicate the occurrence of a framing error in */
#define UART3_UART_PE                            (1U << 2) /* Parity Error bit. This is used to indicate the occurrence of a parity error in t */
#define UART3_UART_OE                            (1U << 1) /* Overrun error bit. This is used to indicate the occurrence of an overrun error.  */
#define UART3_UART_DR                            (1U << 0) /* Data Ready bit. This is used to indicate that the receiver contains at least one */

/* UART3_MCR Register */

#define UART3_UART_AFCE                          (1U << 5) /* Auto Flow Control Enable. When FIFOs are enabled and the Auto Flow Control Enabl */
#define UART3_UART_LB                            (1U << 4) /* LoopBack Bit. This is used to put the UART into a diagnostic mode for test purpo */
#define UART3_UART_RTS                           (1U << 1) /* Request to Send. This is used to directly control the Request to Send (rts_n) ou */

/* UART3_MSR Register */

#define UART3_UART_CTS                           (1U << 4) /* Clear to Send. This is used to indicate the current state of the modem control l */
#define UART3_UART_DCTS                          (1U << 0) /* Delta Clear to Send. This is used to indicate that the modem control line cts_n  */

/* UART3_RAR Register */

#define UART3_UART_RAR_MASK                      (0xFF << 0) /* This is an address matching register during receive mode. If the 9-th bit is set */
#define UART3_UART_RAR_POS                       (0) /* This is an address matching register during receive mode. If the 9-th bit is set */

/* UART3_RBR_THR_DLL Register */

#define UART3_RBR_THR_9BIT                       (1U << 8) /* When 9BIT_DATA_EN, On read :Receive Buffer bit 8 - On write Transmit Buffer bit  */
#define UART3_RBR_THR_DLL_MASK                   (0xFF << 0) /* Receive Buffer Register: (RBR). This register contains the data byte received on */
#define UART3_RBR_THR_DLL_POS                    (0) /* Receive Buffer Register: (RBR). This register contains the data byte received on */

/* UART3_RFL Register */

#define UART3_UART_RECEIVE_FIFO_LEVEL_MASK       (0x1F << 0) /* Receive FIFO Level. This is indicates the number of data entries in the receive  */
#define UART3_UART_RECEIVE_FIFO_LEVEL_POS        (0) /* Receive FIFO Level. This is indicates the number of data entries in the receive  */

/* UART3_SBCR Register */

#define UART3_UART_SHADOW_BREAK_CONTROL          (1U << 0) /* Shadow Break Control Bit. This is a shadow register for the Break bit (LCR[6]),  */

/* UART3_SDMAM Register */

#define UART3_UART_SHADOW_DMA_MODE               (1U << 0) /* Shadow DMA Mode. This is a shadow register for the DMA mode bit (FCR[3]). This c */

/* UART3_SFE Register */

#define UART3_UART_SHADOW_FIFO_ENABLE            (1U << 0) /* Shadow FIFO Enable. This is a shadow register for the FIFO enable bit (FCR[0]).  */

/* UART3_SRBR_STHR0 Register */

#define UART3_SRBR_STHRx_MASK                    (0xFF << 0) /* Shadow Receive Buffer Register x: This is a shadow register for the RBR and has  */
#define UART3_SRBR_STHRx_POS                     (0) /* Shadow Receive Buffer Register x: This is a shadow register for the RBR and has  */

/* UART3_SRBR_STHR10 Register */

#define UART3_SRBR_STHRx_MASK                    (0xFF << 0) /* Shadow Receive Buffer Register x: This is a shadow register for the RBR and has  */
#define UART3_SRBR_STHRx_POS                     (0) /* Shadow Receive Buffer Register x: This is a shadow register for the RBR and has  */

/* UART3_SRBR_STHR11 Register */

#define UART3_SRBR_STHRx_MASK                    (0xFF << 0) /* Shadow Receive Buffer Register x: This is a shadow register for the RBR and has  */
#define UART3_SRBR_STHRx_POS                     (0) /* Shadow Receive Buffer Register x: This is a shadow register for the RBR and has  */

/* UART3_SRBR_STHR12 Register */

#define UART3_SRBR_STHRx_MASK                    (0xFF << 0) /* Shadow Receive Buffer Register x: This is a shadow register for the RBR and has  */
#define UART3_SRBR_STHRx_POS                     (0) /* Shadow Receive Buffer Register x: This is a shadow register for the RBR and has  */

/* UART3_SRBR_STHR13 Register */

#define UART3_SRBR_STHRx_MASK                    (0xFF << 0) /* Shadow Receive Buffer Register x: This is a shadow register for the RBR and has  */
#define UART3_SRBR_STHRx_POS                     (0) /* Shadow Receive Buffer Register x: This is a shadow register for the RBR and has  */

/* UART3_SRBR_STHR14 Register */

#define UART3_SRBR_STHRx_MASK                    (0xFF << 0) /* Shadow Receive Buffer Register x: This is a shadow register for the RBR and has  */
#define UART3_SRBR_STHRx_POS                     (0) /* Shadow Receive Buffer Register x: This is a shadow register for the RBR and has  */

/* UART3_SRBR_STHR15 Register */

#define UART3_SRBR_STHRx_MASK                    (0xFF << 0) /* Shadow Receive Buffer Register x: This is a shadow register for the RBR and has  */
#define UART3_SRBR_STHRx_POS                     (0) /* Shadow Receive Buffer Register x: This is a shadow register for the RBR and has  */

/* UART3_SRBR_STHR1 Register */

#define UART3_SRBR_STHRx_MASK                    (0xFF << 0) /* Shadow Receive Buffer Register x: This is a shadow register for the RBR and has  */
#define UART3_SRBR_STHRx_POS                     (0) /* Shadow Receive Buffer Register x: This is a shadow register for the RBR and has  */

/* UART3_SRBR_STHR2 Register */

#define UART3_SRBR_STHRx_MASK                    (0xFF << 0) /* Shadow Receive Buffer Register x: This is a shadow register for the RBR and has  */
#define UART3_SRBR_STHRx_POS                     (0) /* Shadow Receive Buffer Register x: This is a shadow register for the RBR and has  */

/* UART3_SRBR_STHR3 Register */

#define UART3_SRBR_STHRx_MASK                    (0xFF << 0) /* Shadow Receive Buffer Register x: This is a shadow register for the RBR and has  */
#define UART3_SRBR_STHRx_POS                     (0) /* Shadow Receive Buffer Register x: This is a shadow register for the RBR and has  */

/* UART3_SRBR_STHR4 Register */

#define UART3_SRBR_STHRx_MASK                    (0xFF << 0) /* Shadow Receive Buffer Register x: This is a shadow register for the RBR and has  */
#define UART3_SRBR_STHRx_POS                     (0) /* Shadow Receive Buffer Register x: This is a shadow register for the RBR and has  */

/* UART3_SRBR_STHR5 Register */

#define UART3_SRBR_STHRx_MASK                    (0xFF << 0) /* Shadow Receive Buffer Register x: This is a shadow register for the RBR and has  */
#define UART3_SRBR_STHRx_POS                     (0) /* Shadow Receive Buffer Register x: This is a shadow register for the RBR and has  */

/* UART3_SRBR_STHR6 Register */

#define UART3_SRBR_STHRx_MASK                    (0xFF << 0) /* Shadow Receive Buffer Register x: This is a shadow register for the RBR and has  */
#define UART3_SRBR_STHRx_POS                     (0) /* Shadow Receive Buffer Register x: This is a shadow register for the RBR and has  */

