AlmAck/svdtonuttx/demo/h/da1470x_uart3.h
/* UART3_SRBR_STHR7 Register */

#define UART3_SRBR_STHRx_MASK                    (0xFF << 0) /* Shadow Receive Buffer Register x: This is a shadow register for the RBR and has  */
#define UART3_SRBR_STHRx_POS                     (0) /* Shadow Receive Buffer Register x: This is a shadow register for the RBR and has  */

/* UART3_SRBR_STHR8 Register */

#define UART3_SRBR_STHRx_MASK                    (0xFF << 0) /* Shadow Receive Buffer Register x: This is a shadow register for the RBR and has  */
#define UART3_SRBR_STHRx_POS                     (0) /* Shadow Receive Buffer Register x: This is a shadow register for the RBR and has  */

/* UART3_SRBR_STHR9 Register */

#define UART3_SRBR_STHRx_MASK                    (0xFF << 0) /* Shadow Receive Buffer Register x: This is a shadow register for the RBR and has  */
#define UART3_SRBR_STHRx_POS                     (0) /* Shadow Receive Buffer Register x: This is a shadow register for the RBR and has  */

/* UART3_SRR Register */

#define UART3_UART_XFR                           (1U << 2) /* XMIT FIFO Reset. This is a shadow register for the XMIT FIFO Reset bit (FCR[2]). */
#define UART3_UART_RFR                           (1U << 1) /* RCVR FIFO Reset. This is a shadow register for the RCVR FIFO Reset bit (FCR[1]). */
#define UART3_UART_UR                            (1U << 0) /* UART Reset. This asynchronously resets the UART Ctrl and synchronously removes t */

/* UART3_SRTS Register */

#define UART3_UART_SHADOW_REQUEST_TO_SEND        (1U << 0) /* Shadow Request to Send. This is a shadow register for the RTS bit (MCR[1]), this */

/* UART3_SRT Register */

#define UART3_UART_SHADOW_RCVR_TRIGGER_MASK      (0x3 << 0) /* Shadow RCVR Trigger. This is a shadow register for the RCVR trigger bits (FCR[7: */
#define UART3_UART_SHADOW_RCVR_TRIGGER_POS       (0) /* Shadow RCVR Trigger. This is a shadow register for the RCVR trigger bits (FCR[7: */

/* UART3_STET Register */

#define UART3_UART_SHADOW_TX_EMPTY_TRIGGER_MASK  (0x3 << 0) /* Shadow TX Empty Trigger. This is a shadow register for the TX empty trigger bits */
#define UART3_UART_SHADOW_TX_EMPTY_TRIGGER_POS   (0) /* Shadow TX Empty Trigger. This is a shadow register for the TX empty trigger bits */

/* UART3_TAR Register */

#define UART3_UART_TAR_MASK                      (0xFF << 0) /* This is an address matching register during transmit mode. If DLS_E (LCR_EXT[0]) */
#define UART3_UART_TAR_POS                       (0) /* This is an address matching register during transmit mode. If DLS_E (LCR_EXT[0]) */

/* UART3_TFL Register */

#define UART3_UART_TRANSMIT_FIFO_LEVEL_MASK      (0x1F << 0) /* Transmit FIFO Level. This is indicates the number of data entries in the transmi */
#define UART3_UART_TRANSMIT_FIFO_LEVEL_POS       (0) /* Transmit FIFO Level. This is indicates the number of data entries in the transmi */

/* UART3_TIMER Register */

#define UART3_ISO7816_TIM_MODE                   (1U << 17) /* 0 : Timer will count up to max value then stops. Timer has to be disabled and en */
#define UART3_ISO7816_TIM_EN                     (1U << 16) /* 0 : Timer is disabled 1 : Timer is enabled */
#define UART3_ISO7816_TIM_MAX_MASK               (0xFFFF << 0) /* On write : timer will count from 0 to ISO7816_TIM_MAX On read : gives the curren */
#define UART3_ISO7816_TIM_MAX_POS                (0) /* On write : timer will count from 0 to ISO7816_TIM_MAX On read : gives the curren */

/* UART3_UCV Register */

#define UART3_UART_UCV_MASK                      (0xFFFFFFFF << 0) /* Component Version */
#define UART3_UART_UCV_POS                       (0) /* Component Version */

/* UART3_USR Register */

#define UART3_UART_RFF                           (1U << 4) /* Receive FIFO Full. This is used to indicate that the receive FIFO is completely  */
#define UART3_UART_RFNE                          (1U << 3) /* Receive FIFO Not Empty. This is used to indicate that the receive FIFO contains  */
#define UART3_UART_TFE                           (1U << 2) /* Transmit FIFO Empty. This is used to indicate that the transmit FIFO is complete */
#define UART3_UART_TFNF                          (1U << 1) /* Transmit FIFO Not Full. This is used to indicate that the transmit FIFO in not f */
#define UART3_UART_BUSY                          (1U << 0) /* UART Busy. This indicates that a serial transfer is in progress, when cleared in */

#endif /* __DA1470X_UART3_H */
